rammp-org/pace-hmi-fw/sdkconfig.defaults
# TODO: uncomment one of these if you want to support a specifc target by default
# CONFIG_IDF_TARGET="esp32"
# CONFIG_IDF_TARGET="esp32s2"
# CONFIG_IDF_TARGET="esp32s3"
# CONFIG_IDF_TARGET="esp32c3"
# CONFIG_IDF_TARGET="esp32c6"
# CONFIG_IDF_TARGET="esp32h2"
CONFIG_IDF_TARGET="esp32p4"

# This board's ESP32-P4 is silicon revision v1.3. Rev <3.0 and >=3.0 support is
# mutually exclusive in ESP-IDF; the default (v3.1+) refuses to flash this chip.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# Rev <3.0 silicon runs the CPU from a 360MHz CPLL; 400MHz (the v3.x default)
# fails the esp_clk_init assert at boot.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# 16MB flash with a custom partition table (two 6M OTA slots + storage)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# espp::FileSystem (LittleFS) mounts the partition with this label, at
# /storage. First boot formats it. Holds the joystick calibration.
CONFIG_ESPP_FILE_SYSTEM_PARTITION_LABEL="storage"

# PSRAM - required for the MIPI DSI frame buffer (matches the m5stack-tab5
# BSP example's config)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
#
# XIP-from-PSRAM is deliberately OFF (it is also the IDF default).
#
# It selects SPIRAM_FETCH_INSTRUCTIONS + SPIRAM_RODATA, which move .text and
# .rodata out of flash and into PSRAM at boot. On the P4 flash and PSRAM sit on
# two SEPARATE SPI buses, so that does not offload anything -- it piles code
# fetch and rodata reads onto the one bus the DSI scanout is already saturating.
# This panel pulls 720*1280*2 B at ~58 Hz = ~106 MB/s continuously (~140 MB/s
# instantaneous during active pixels), and the UI's image assets are rodata:
# ui_img_lock_png alone is 189 KB of A8. When the DSI bridge FIFO runs dry it
# emits black, which shows up as black horizontal lines across the frame --
# visible only where they cross non-black content, i.e. "lines in the icons".
# The bridge logs "underrun happens" (ESP_DRAM_LOGE) when this occurs.
#
# Leaving it off costs the ability to run arbitrary code during a flash
# write/erase without IRAM placement, which this firmware does not need.
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compile at -O2: LVGL renders transition frames in software on the CPU, and
# debug optimization (-Og, the IDF default) makes full-screen redraws several
# times slower.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# W5500 SPI Ethernet on the M5-Bus header (SCK=GPIO5, MOSI=GPIO18,
# MISO=GPIO19, CS=GPIO45, INT=GPIO52) â€” network transport for RTPS. The W5500
# chip driver itself comes from the espressif/w5500 managed component (in IDF
# 6.0 the SPI-Ethernet chip drivers moved out of esp_eth to the registry).
CONFIG_ETH_USE_SPI_ETHERNET=y

# Font sizes referenced by the SquareLine UI export (main/ui/screens). Any size
# used there must be enabled here or the build fails on an undeclared
# lv_font_montserrat_<N>.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Custom fonts exported by SquareLine can be far larger than the Montserrat set
# above (ui_font_IBMPlexSansMedium264 is 264 px). Past a point the glyph
# bitmap/advance-width bitfields in lv_font_fmt_txt overflow their default
# widths, and the generated .c fails to compile with an explicit
# "Too large font or glyphs ... Enable LV_FONT_FMT_TXT_LARGE" #error. This
# widens those fields for every font, costing a little flash.
CONFIG_LV_FONT_FMT_TXT_LARGE=y

# Task stack sizes and tick rate from the m5stack-tab5 BSP example â€” the
# default 3.5K main stack overflows during LVGL/audio/ADC setup.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want freertos to run at 1 khz instead of the default 100 hz
# CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want to run the esp at max clock speed (240 mhz)
# ESP32-specific
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# TODO: uncomment if you want to update the event and main task stask sizes
# Common ESP-related
#
# CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# SVG rendering is OFF, and with it the whole vector engine.
#
# The SquareLine export embeds SVG assets as raw .svg text in
# main/ui/images/ui_img_*.c, and drawing those needs LV_USE_SVG -> depends on
# LV_USE_VECTOR_GRAPHIC -> whose only software backend is ThorVG. So one image
# pulled in the entire vector rasteriser.
#
# By the end there was exactly ONE such asset left: the BootScreen wordmark.
# It is now pre-rasterised at build time into main/boot_logo.c as an A8 alpha
# mask, and main.cpp swaps it over the export's SVG source after ui_init (the
# swap lives there because import_ui.ps1 mirrors main/ui/ with robocopy /MIR and
# would put the SVG back on the next import). Re-generate that file if the logo
# artwork changes.
#
# Worth ~135 KB of code: the binary SHRANK by 45 KB even after adding 89 KB of
# raster data. It also frees internal RAM, and removes ThorVG's thread stacks as
# the blocker on parallel rendering (see the note further down, which is now
# blocked on something else instead).
#
# Turn these back on if a genuine vector asset ever returns; nothing else here
# depends on them.
# CONFIG_LV_USE_VECTOR_GRAPHIC is not set
# CONFIG_LV_USE_THORVG is not set
# CONFIG_LV_USE_SVG is not set
#
# Deliberately not listed: LV_USE_THORVG_INTERNAL. It is a member of LVGL's
# "Use ThorVG config" choice, which LV_USE_THORVG=n already hides, and setting
# a choice's only listed member to n without selecting another crashes the
# kconfgen in CI's esp-idf v6.0 image ("'NoneType' object has no attribute
# 'name'"). The newer esp-idf-kconfig installed locally tolerates it, so a
# local build will not catch this -- and CI generates sdkconfig from this file
# alone, since sdkconfig itself is gitignored.

# --- Rendering performance (step 1) ---
# The refresh timer is already forced to 16 ms at runtime in main.cpp; match the
# compiled-in default so the two cannot disagree.
CONFIG_LV_DEF_REFR_PERIOD=16
#
# NOT re-enabling the image cache. Measured: 176.0 -> 175.5 ms (~1%), because the
# cost was ThorVG RASTERIZING the vectors, not parsing them -- caching the parsed
# render list did not avoid the rasterization. That measurement is now historical
# (ThorVG is gone, see above), but the conclusion holds for a different reason:
# every remaining asset is already raster, so there is no decode left to cache.
#
# The OOM half of this argument no longer applies: it said the decoder's many
# small nodes land in internal RAM because CMakeLists forces
# LV_USE_STDLIB_MALLOC=LV_STDLIB_CLIB and ALWAYSINTERNAL was 16384. That knob is
# 512 now (see the internal RAM split below), so those nodes would go to PSRAM
# and a 4 MB budget is no longer a latent OOM. The ~1% is the reason to leave it
# off, not the memory.

# --- Rendering performance (step 2: PPA draw unit) ---
# LVGL 9.5 ships an Espressif PPA draw unit that runs rect fills and RGB565
# image blits on the P4's Pixel Processing Accelerator instead of the CPU. It
# hard-requires LV_DRAW_BUF_ALIGN == CONFIG_CACHE_L2_CACHE_LINE_SIZE (128).
# That is only safe now that the draw buffers ARE the DPI panel's frame buffers,
# which the driver allocates cache-line aligned; the previous attempt used
# espp's heap_caps_malloc buffers (4/8-byte aligned) and boot-looped on the
# "buf1 is not aligned" assert in lv_display_set_buffers.
CONFIG_LV_DRAW_BUF_ALIGN=128
# LV_USE_PPA is OFF. Its draw unit only ever writes the cache BACK (C2M) and
# never invalidates (M2C) -- grep the ppa dir, there is no M2C anywhere. So after
# the PPA's DMA writes pixels, the CPU's cached copy of that region is stale, and
# refr_sync_areas' lv_draw_buf_copy then propagates those stale pixels into the
# other frame buffer. The two buffers drift apart and LVGL alternates between
# them every refresh -> the screen visibly blinks on a static image.
# It also ignores the `area` argument and msyncs the whole 1.8 MB frame buffer
# twice per PPA task (lv_draw_ppa_buf.c:42), which scales with task count rather
# than pixel count -- so it may well be a net slowdown here too.
# Re-enable only with an area-scoped C2M + M2C fix in the draw unit.
# CONFIG_LV_USE_PPA=y
# CONFIG_LV_USE_PPA_IMG=y

# LVGL's built-in FPS/CPU overlay (lv_sysmon), toggled at runtime from the
# FPS COUNTER row in the settings menu via lv_sysmon_show/hide_performance().
# LV_USE_PERF_MONITOR depends on LV_USE_SYSMON, and the position is a
# compile-time choice -- default is BOTTOM_RIGHT, we want the top right corner.
# NOTE: sdkconfig.defaults only seeds a *fresh* sdkconfig, so these are also set
# in the (gitignored) sdkconfig for the current build tree.
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_PERF_MONITOR_ALIGN_TOP_RIGHT=y

# Parallel software rendering (LV_DRAW_SW_DRAW_UNIT_CNT=2 + LV_OS_FREERTOS) is
# still OFF -- but no longer for the ThorVG reason recorded here previously.
#
# That note ended with "drop LV_USE_THORVG entirely" as the next thing to try.
# Done (see the top of this file), and it worked: with ThorVG gone the stack
# fault in rleRender is gone and two draw units run. Measured with the built-in
# kFpsInstrument/kFpsStress flags in main.cpp, full-screen invalidate every LVGL
# cycle, RENDER_START -> RENDER_READY:
#
#   cache  units | render     result
#   256KB    1   | 84.4 ms    stable          <- chosen
#   256KB    2   | 48.9 ms    BOOT LOOP       42% faster, but see below
#   128KB    2   | 80.0 ms    stable          cache loss eats the gain
#
# The 2-unit boot loop is the DMA one, not a stack one: each draw thread's stack
# comes out of internal RAM, which starves the pool the W5500's SPI bounce buffer
# needs, and spi_master does not null-check that allocation (same failure as the
# one described under the internal RAM split below). Raising
# RESERVE_INTERNAL does NOT fix it -- FreeRTOS task stacks also qualify as
# internal and simply eat the larger reserve; measured DMA-capable free actually
# FELL to 3.8 KB at RESERVE_INTERNAL=98304.
#
# Dropping L2 cache to 128 KB frees the 128 KB of SRAM that would pay for it, and
# is stable -- but the cache is worth more than the second core: 46% slower
# rendering against a 42% parallel gain, i.e. 80.0 ms vs the 84.4 ms we already
# have. Not worth threading the renderer for 5%.
#
# So this needs ~40 KB of internal RAM found somewhere that is not the cache.
# Note also that LVGL's FreeRTOS port divides the stack size by
# sizeof(StackType_t) (vanilla FreeRTOS counts words) while ESP-IDF's
# xTaskCreate already takes BYTES -- so LV_DRAW_THREAD_STACK_SIZE under-allocates
# 4x and has to be set to 4x whatever you actually want.

# --- Internal RAM split (measured; see the table below) ---
# Two knobs that only make sense together. The P4 has ~500 KB of internal SRAM
# and 32 MB of PSRAM; what goes where decides both whether the board boots with
# Ethernet attached and how fast LVGL renders.
#
# ALWAYSINTERNAL is the size below which malloc() PREFERS internal RAM. At the
# 16384 default that is every LVGL allocation, so ui_init's ~118 KB of widgets
# and styles landed in internal RAM and stayed there. Internal was then full by
# the time the RTPS participant started, and LVGL's per-frame draw allocations
# spilled to PSRAM instead -- exactly backwards. The widget tree is touched
# once per object per frame; the draw buffers are touched per pixel.
#
# RESERVE_INTERNAL is a pool held back from ordinary malloc for requests that
# can ONLY be served from internal RAM. The W5500's SPI transactions need a
# DMA-capable bounce buffer allocated late -- after ui_init and after the RTPS
# participant -- and spi_master does not check that allocation for NULL. When
# it ran dry the board took a load access fault in memcpy and boot-looped ~13 s
# in, as soon as DHCP handed out an address. Lowering ALWAYSINTERNAL puts MORE
# buffers in PSRAM and so needs MORE bounce buffers, which is the second reason
# this is raised rather than left at its 32768 default.
#
# Measured with a full-screen invalidate every 10 ms, steady state after RTPS
# start (render = CPU time to draw a frame, excluding the vsync wait):
#
#   reserve  always  | render    internal free  result
#   32768    4096    |    --           --       BOOT LOOP (DMA pool dry)
#   65536    16384   |  142 ms      25.7 KB     no crash, visibly laggy
#   32768    512     | 85.7 ms      37.4 KB     ok
#   65536    512     | 85.7 ms      37.4 KB     ok  <- chosen
#
# 512 rather than 0 so genuinely tiny allocations stay internal. The two 512
# rows perform identically, so the larger reserve is free headroom against the
# boot loop above.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# --- Rendering performance (step 3: measured Phase 1 sweep) ---
# Numbers below are a full-screen 1280x720 invalidate forced every 10 ms, so
# they are a worst case -- normal use only redraws dirty areas. `render` is the
# CPU cost of drawing a frame, excluding the vsync wait.
#
# Reference points measured on the way:
#   MainScreenFlex, as it was          86.0 ms
#   an empty screen (frame buffer)     19.6 ms   <- 77% of a frame was content
#   after removing overdraw            62.5 ms   (see strip_redundant_backgrounds)
#
# Then, each lever on its own against that 62.5 ms:
#
#   lever                              render    verdict
#   L2 cache 256 -> 128 KB             91.2 ms   REJECT, 46% worse
#   LVGL rasteriser into IRAM (25 KB)  ~1% gain  REJECT, and it boot-loops:
#                                                code in SRAM fragments the DMA
#                                                pool the W5500 bounce buffer
#                                                needs (see the RAM split above)
#   flash DIO@80 -> QIO@80             53.3 ms   ACCEPT, 15% better
#
# The cache is emphatically worth its 256 KB of L2MEM: giving 128 KB of it back
# to the heap cost more than the heap ever returned. And the rasteriser is not
# instruction-fetch bound, which is why parking it in IRAM did nothing -- but
# QIO helps anyway, because the image DATA is read from flash through the same
# bus.
#
# Not taken: 512 KB L2 cache is impossible (SRAM_START is 0x4FF00000 + the cache
# size against a 0x80000 L2MEM, so it would leave zero SRAM), PSRAM is already
# at its 200 MHz HEX ceiling, and the panel at ~60 Hz was never the limit.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# espp/rtps endpoint pools. SPDP takes 1 best-effort writer + 1 reader; the HMI
# adds 7 writers (5 + OtaDeviceInfo + serial) and 6 readers (4 + OtaCommand +
# serial). With SEDP's 2 each, that is also every one of the 10 writers a
# participant may have (NUM_WRITERS_PER_PARTICIPANT). The callbacks limit is per
# reader, not a pool.
CONFIG_RTPS_LIMIT_NUM_STATELESS_WRITERS=8
CONFIG_RTPS_LIMIT_NUM_STATELESS_READERS=7
CONFIG_RTPS_LIMIT_MAX_NUM_READER_CALLBACKS=6

# --- Firmware update over Ethernet (main/ota_update.cpp) ---
# A freshly updated app boots PENDING_VERIFY and is rolled back by the bootloader
# if it resets before confirming itself. It confirms once Ethernet and RTPS are
# up (ota_boot_confirm), and rolls itself back if that does not happen in time.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# The DSI scanout is restarted every frame from the DMA's interrupt. Without this
# that interrupt waits out every flash write, so an OTA (continuous writes) starved
# the panel: measured 105 ms without a restart, seen as the screen blinking blue.
CONFIG_LCD_DSI_ISR_CACHE_SAFE=y
# RTPS takes ~4 sockets; the OTA session (listener + client) and the network
# console (listener + client) add 4 more, and ping one transiently.
CONFIG_LWIP_MAX_SOCKETS=16
# The update host sends one DATA frame at a time and waits for its reply. Sending
# several ahead (with a larger TCP window) was measured slower: with two or more
# frames in flight the W5500 driver reports "RX buffer corruption detected,
# draining", and each drain costs a TCP retransmit (35.9 s at 1, 39.3 s at 2,
# 55.3 s at 3 for a 5 MB image). Compressing the image is what helps (29.2 s).
